phatware/canres/da1469X/SDK_10.0.10.118/config/embsys/Dialog_Semiconductor/DA1469x.xml
Note 1: DWord (64 bits) access is not supported by the Cache Data RAM interface in mirrored mode (only 32, 16 and 8 bits).Note 2: DMA access is not supported by the Cache Data RAM interface when REMAP_ADR0=0x6.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SYS_STAT_REG</name>
	<description>System status register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000025a5</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>POWER_IS_UP</name>
	<description>Indicates that the Startup statemachine is finished, and all power regulation is in order.
In UltraFastWakeup mode, the SW needs to wait for this signal before starting any heavy traffic.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DBG_IS_ACTIVE</name>
	<description>Indicates that a debugger is attached.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COM_IS_UP</name>
	<description>Indicates that PD_COM is functional </description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COM_IS_DOWN</name>
	<description>Indicates that PD_COM is in power down </description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_IS_UP</name>
	<description>Indicates that PD_TIM is functional </description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_IS_DOWN</name>
	<description>Indicates that PD_TIM is in power down </description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MEM_IS_UP</name>
	<description>Indicates that PD_MEM is functional</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MEM_IS_DOWN</name>
	<description>Indicates that PD_MEM is in power down</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYS_IS_UP</name>
	<description>Indicates that PD_SYS is functional </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYS_IS_DOWN</name>
	<description>Indicates that PD_SYS is in power down </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PER_IS_UP</name>
	<description>Indicates that PD_PER is functional </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PER_IS_DOWN</name>
	<description>Indicates that PD_PER is in power down </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RAD_IS_UP</name>
	<description>Indicates that PD_RAD is functional </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RAD_IS_DOWN</name>
	<description>Indicates that PD_RAD is in power down </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>VBUS_IRQ_CLEAR_REG</name>
	<description>Clear pending IRQ register</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VBUS_IRQ_CLEAR</name>
	<description>Writing any value to this register will reset the VBUS_IRQ line</description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>VBUS_IRQ_MASK_REG</name>
	<description>IRQ masking</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>VBUS_IRQ_EN_RISE</name>
	<description>Setting this bit to '1' enables VBUS_IRQ generation when the VBUS starts to ramp above threshold</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VBUS_IRQ_EN_FALL</name>
	<description>Setting this bit to '1' enables VBUS_IRQ generation when the VBUS starts to fall below threshold</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_XTAL</name>
	<version>1.0</version>
	<description>CRG_XTAL registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50010000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>116</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>CLK_FREQ_TRIM_REG</name>
	<description>Xtal frequency trimming register.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x2bfafd70</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields><field>
	<name>XTAL32M_START</name>
	<description>Xtal frequency trimming register - START phase of startup
0x2BF = lowest frequency (high load capacitance)
0x000 = highest frequency (low load capacitance)
Cload = 5.0p + 6.09p * XTAL32M_TRIM/0x2BF- this includes the PCB parasitic capacitances of the reference desing</description>
	<bitRange>[29:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_RAMP</name>
	<description>Xtal frequency trimming register - RAMP phase of startup.
0x2BF = lowest frequency (high load capacitance)
0x000 = highest frequency (low load capacitance)
Cload = 5.0p + 6.09p * XTAL32M_TRIM/0x2BF- this includes the PCB parasitic capacitances of the reference desing</description>
	<bitRange>[19:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM</name>
	<description>Xtal frequency trimming register.
0x2BF = lowest frequency (high load capacitance)
0x000 = highest frequency (low load capacitance)
Cload = 5.0p + 6.09p * XTAL32M_TRIM/0x2BF- this includes the PCB parasitic capacitances of the reference desing</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_SYS_CTRL1_REG</name>
	<description>System PLL control register 1.</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00006860</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PLL_SEL_MIN_CUR_INT</name>
	<description>0: VCO current read from min_current &lt;5:0&gt;,
1: VCO current is internally determined with a calibration algoritm.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_PRE_DIV</name>
	<description>PLL input divider (1: Indicates divide by 2).</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_N_DIV</name>
	<description>PLL loop divider N (x means divide by x, 0 means divide by 1) </description>
	<bitRange>[10:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_PLL_VREF_HOLD</name>
	<description>0: Indicates that the reference input is tracked,
1: Indicates that the reference input is sampled.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_PLL_ENABLE</name>
	<description>0: LDO PLL off,
1: LDO PLL on.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_EN</name>
	<description>0: Power down
1: PLL on </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_SYS_CTRL2_REG</name>
	<description>System PLL control register 2.</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000c00</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PLL_RECALIB</name>
	<description>Recalibrate</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_SYS_CTRL3_REG</name>
	<description>System PLL control register 3.</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00008070</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PLL_TEST_VCTR</name>
	<description>1: map loopfilter voltage on external pin &lt;tbd&gt; </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_MIN_CURRENT</name>
	<description>VCO current trimming.</description>
	<bitRange>[6:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_SYS_STATUS_REG</name>
	<description>System PLL status register.</description>
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>LDO_PLL_OK</name>
	<description>1: Indicates that LDO PLL is in regulation.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_CALIBRATION_END</name>
	<description>Indicates that calibration has finished.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_BEST_MIN_CUR</name>
	<description>Calibrated VCO current.</description>
	<bitRange>[10:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_LOCK_FINE</name>
	<description>1: PLL locked </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TRIM_CTRL_REG</name>
	<description>Control trimming of the XTAL32M</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000522</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>XTAL_SETTLE_N</name>
	<description>Designates that the XTAL can be safely used as the CPU clock. When XTAL_CLK_CNT reases this value, the signal XTAL_SETTLE_READY will be set</description>
	<bitRange>[13:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL_TRIM_SELECT</name>
	<description>Select which source controls the XTAL trimming
0b00: xtal counter. Starts CLK_FREQ_TRIM_REG[XTAL32M_START] after COUNT_N * 32 xtal pulses trim is changed to CLK_FREQ_TRIM_REG[XTAL32M_TRIM].
0b01: xtal OK filter. Starts with CLK_FREQ_TRIM_REG[XTAL32M_START], when xtal is ramping is changed to CLK_FREQ_TRIM_REG[XTAL32M_TRIM].
0b10: statically forced off. Only uses CLK_FREQ_TRIM_REG[XTAL32M_TRIM].
0b11: xtal OK filter, 2 stage. Starts with CLK_FREQ_TRIM_REG[XTAL32M_START] switches to CLK_FREQ_TRIM_REG[XTAL32M_RAMP] after timeout (sw1='1', XTAL32M_CTRL0_REG[XTAL32M_SW_DELAY]), and switches to CLK_FREQ_TRIM_REG[XTAL32M_TRIM] when sw2='1'.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL_COUNT_N</name>
	<description>Defines the number of XTAL cycles to be counted, before the xtal trimming is applied, in steps of 32.
0x01: 32
0x02: 64
0x3f:2016 </description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CTRL0_REG</name>
	<description>Control register for XTAL32M</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0b82e6b4</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>XTAL32M_DXTAL_SYSPLL_ENABLE</name>
	<description>Enables DXTAL for the system PLL.</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CORE_CUR_SET</name>
	<description>Core current trim setting.
0x0: min current
...
0x3: default current
...
0x6 max amplitude
0x7 is equal to 0x3.</description>
	<bitRange>[17:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_RCOSC_CALIBRATE</name>
	<description>Request an RC-oscillator calibration. If set, calibration will be started after xtal startup.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_RCOSC_XTAL_DRIVE</name>
	<description>Enable drive of crystal by RCOSC, needed for fast startup</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CXCOMP_ENABLE</name>
	<description>Enable the shunt-capacitance compensation amplifier circuit (OSF BOOST).</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CTRL1_REG</name>
	<description>Control register for XTAL32M</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x7503e8a4</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>XTAL32M_STARTUP_TDISCHARGE</name>
	<description>Discharge time.
0x0: disable
0x1: 8 us
0x2: 4 us
0x3: 2 us
0x4: 1 us
0x5: 1/2 us
0x6: 1/8 us
0x7: 1/32 us</description>
	<bitRange>[30:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_STARTUP_TSETTLE</name>
	<description>Settle time.
0x0: 16 us
0x1: 8 us
0x2: 4 us
0x3: 2 us
0x4: 1 us
0x5: 1/2 us
0x6: 1/4 us
0x7: 1/8 us</description>
	<bitRange>[26:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_XTAL_ENABLE</name>
	<description>Enable xtal (startup) or enable xtal block (software control mode) - testing only, to enable xtal, use PDC.</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_STARTUP_TDRIVE_LSB</name>
	<description>LSB part of the sequence drive time. From 0 to 32us with steps of 1/32us.</description>
	<bitRange>[22:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_DRIVE_CYCLES</name>
	<description>Number of sequences to drive at startup.</description>
	<bitRange>[12:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_STARTUP_TDRIVE</name>
	<description>Drive time of the sequence.
0x0: 32 us
0x1: 16 us
0x2: 8 us
0x3: 4 us
0x4: 2 us
0x5: 1 us
0x6: 1/2 us
0x7: 1/4 us</description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_RCOSC_SYNC_DELAY_TRIM</name>
	<description>Synchronization mode delay trim..</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CTRL2_REG</name>
	<description>Control register for XTAL32M</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x001e4007</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>XTAL32M_RCOSC_TRIM_SNS</name>
	<description>Trim sensitivity used during calibration of the RC-oscillator.
XTAL_RCOSC_TRIM_SNS = 128/(M0*S)
M0=8196
S = sensitivity of RCOSC (~128ppm/LSB)
Using the internal frequency counter
S = (FreqDetHigh -FreqDetLow) /(M*D)
FreqDetHigh, FreqDetLow: the frequency counter reading (XTAL32M_STAT0_REG.FREQ_DET_OUT) at trim setting T0 and T1 (XTAL32M_CTRL3_REG.XTAL32M_RCOSC_TRIM)
D = T0 - T1
M -&gt; see XTAL32M_CTRL2_REG.XTAL32M_FREQ_DET_LEN
XTAL_RCOSC_TRIM_SNS = 64 * D / (FreqDetHigh-FreqDetLow), when XTAL32M_FREQ_DET_LEN = 1</description>
	<bitRange>[21:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CXCOMP_PHI_TRIM</name>
	<description>Phase correction for cxcomp circuit.</description>
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CXCOMP_TRIM_CAP</name>
	<description>Size of shunt capacitance compensation cap</description>
	<bitRange>[11:3]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CTRL3_REG</name>
	<description>Control register for XTAL32M</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00096255</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>XTAL32M_RCOSC_TRIM_STROBE</name>
	<description>Force RC-oscillator trim setting.</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_FREQ_DET_START</name>
	<description>Force start frequency detector.</description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_SW_CTRL_MODE</name>
	<description>Enable all the software overrides, the state-machine will remain in IDLE.</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_RCOSC_BAND_SELECT</name>
	<description>Set RCOSC band select - apply with RCOSC_TRIM_STROBE</description>
	<bitRange>[17:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_RCOSC_TRIM</name>
	<description>Set RCOSC trim (fine) - apply with RCOSC_TRIM_STROBE</description>
	<bitRange>[13:4]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CTRL4_REG</name>
	<description>Control register for XTAL32M</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	
