phatware/canres/da1469X/SDK_10.0.10.118/config/embsys/Dialog_Semiconductor/DA1469x.xml
	<registers>
	<register>
	<name>LCDC_BACKPORCHXY_REG</name>
	<description>Back Porch X and Y</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LCDC_BPORCH_X</name>
	<description>Back porch X (lines)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_BPORCH_Y</name>
	<description>Back porch Y (pixel clocks)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_BGCOLOR_REG</name>
	<description>Background Color</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LCDC_BG_RED</name>
	<description>Red color used as background.</description>
	<bitRange>[31:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_BG_GREEN</name>
	<description>Green color used as background.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_BG_BLUE</name>
	<description>Blue color used as background.</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_BG_ALPHA</name>
	<description>Alpha color used as background.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_BLANKINGXY_REG</name>
	<description>Blanking X and Y</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LCDC_BLANKING_X</name>
	<description>Blanking period X (VSYNC lines)</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_BLANKING_Y</name>
	<description>Blanking period Y (HSYNC pulse length)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_CLKCTRL_REG</name>
	<description>Clock Divider</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000401</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LCDC_SEC_CLK_DIV</name>
	<description>Secondary clock divider that generates the format pipeline clock. Source clock of this divider is the main clock of LCD controller. The period of the generated clock is defined as : (LCDC_SEC_CLK_DIV + 1) x period_of_main_clock.</description>
	<bitRange>[31:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DMA_HOLD</name>
	<description>Hold time before DMA activated.</description>
	<bitRange>[13:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_CLK_DIV</name>
	<description>Clock divider that generates the pixel pipeline clock. Source clock of this divider is the format pipeline clock (see also LCDC_SEC_CLK_DIV). The period of the generated clock is defines as : LCDC_CLK_DIV x period_of_format_clk. A zero value gives division by one.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LCDC_CRC_REG</name>
	<description>CRC check</description>
	<addressOffset>0x00000184</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LCDC_CRC</name>
	<description>CRC check.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LCDC_DBIB_CFG_REG</name>
	<description>MIPI Config Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LCDC_DBIB_TE_DIS</name>
	<description>Disable the sampling of the tearing effect signal, which is provided by the LCD device.
0: the tearing effect signal is sampled
1: the tearing effect signal is not sampled.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_CSX_FORCE</name>
	<description>Forces the DBIB CSX value. When is enabled the DBIB CSX takes the value of the LCDC_DBIB_CSX_FORCE_VAL.
0 : disable
1 : enable</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_CSX_FORCE_VAL</name>
	<description>Value of DBIB CSX to be forced, if bit 30 is set. Defines also the active level of the DBIB CSX even if the bit 30 is not set.</description>
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_SPI_PAD</name>
	<description>Data padding :
0 : disable
1 : enable</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_RESX</name>
	<description>DBIB RESX, reset signal for MIPI DBIB display.</description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_DMA_EN</name>
	<description>Send pixels from DMA to DBIB display.
0 : disable
1 : enable</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_SPI3_EN</name>
	<description>Enable SPI3 interface.
0 : disable
1 : enable</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_SPI4_EN</name>
	<description>Enable SPI4 interface.
0 : disable
1 : enable</description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_SPI_CPHA</name>
	<description>Sets the data phase for the SPI interface</description>
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_SPI_CPOL</name>
	<description>Sets the polarity of the clock (SCL)</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_SPI_JDI</name>
	<description>Enables the line addressing between the horizontal lines (JDI SPI output format).
0 : disable
1 : enable</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_SPI_HOLD</name>
	<description>Enables the command HOLD mode of operation. Commands and data transmissions binding.
0 : disable
1 : enable</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_SPI_INV_ADDR</name>
	<description>Enables horizontal line address inversion.
0 : disable
1 : enable</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_INV_DATA</name>
	<description>Data inversion
0 : disable
1 : enable</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_JDI_INV_PIX</name>
	<description>MSB-LSB bit selection for JDI parallel interface
0 : disable (MSB - LSB)
1 : enable (LSB -MSB)</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_JDI_SOFT_RST</name>
	<description>JDI timing generation soft reset.
0 : disable
1 : enable</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCDC_DBIB_FMT</name>
	<description>Defines the output format and depends of the type of the output interface. For the SPI3/SPI4 are supported the following formats:
0x06 : RGB111-1 {2b00, R(n), G(n), B(n), R(n+1), G(n+1), B(n+1)}
0x07 : RGB111-2 {R(n), G(n), B(n), 1b0, R(n+1), G(n+1), B(n+1), 1b0}
0x08 : RGB111-3 {R(n), G(n), B(n), R(n+1), G(n+1), B(n+1), R(n+2), G(n+2), B(n+2),... }
0x09 : RGB111-4 {D(n), D(n+1), D(n+2),...}
0x10 : RGB332
0x11 : RGB444
0x12 : RGB565
0x13 : RGB666
0x14 : RGB888

