phatware/canres/da1469X/SDK_10.0.10.118/config/embsys/Dialog_Semiconductor/DA1469x.xml
	<registers>
	<register>
	<name>LRA_ADC_CTRL1_REG</name>
	<description>General Purpose ADC Control Register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>LRA_ADC_BUSY</name>
	<description>0:ADC conversion ready.
1:ADC conversion in progress.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LRA_ADC_OFFSET</name>
	<description>ADC offset compensation value.
Signed value with 3 fractional bits.
-16 (0x80) to +15.875 (0x7F) in intervals of 0.125 (0x01).
Note: ADC gain error must be compensated in the calculation of VREF.</description>
	<bitRange>[16:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LRA_ADC_TEST_PARAM</name>
	<description>Select which inputs will be enabled on the ADC.
0,1 = normal inputs (i.e. both I and Q inputs connected to LRA-current-sense voltage source)
2 = I channel connected to the analog input testbus on PORTS P14 and P15, Q channel is muted.
3 =Q channel connected to the analog input testbus on PORTS P14 and P15, I channel is muted.
Note: The LRA_ADC_CTRL1_REG[ADC_MUTE] field takes precedence over this test functionality. </description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LRA_ADC_TEST_IN_SEL</name>
	<description>Select analog testbus on ADC input.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LRA_ADC_FREQ</name>
	<description>ADC clock divider</description>
	<bitRange>[6:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LRA_ADC_SIGN</name>
	<description>Change polarity of ADC input</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LRA_ADC_MUTE</name>
	<description>0: Normal operation
1: Short the inputs of the ADC (used for DC offset cal) </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LRA_ADC_START</name>
	<description>0: ADC conversion ready.
1: If a 1 is written, the ADC starts a conversion. After the conversion this bit will be set to 0 and the GP_ADC_INT bit will be set. It is not allowed to write this bit while it is not (yet) zero. </description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>LRA_ADC_RESULT_REG</name>
	<description>General Purpose ADC Result Register</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MAN_FLT_IN</name>
	<description>Manual value to replace the ADC output. Select its use by FLT_IN_SEL.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_VAL</name>
	<description>Returns the 10 up to 16 bits linear value of the last AD conversion as a signed value. The most significant 11 bits are always valid, the lower 5 bits are only valid in case oversampling has been applied. Two samples results in one extra bit and 32 samples results in 5 extra bits.
In the context of the LRA constant current or constant duty cycle control systems, the (non-oversampled) value is interpreted as a signed value with 7 integer bits and 3 fractional bits: -128.000 (0x8000) to +127.875 (0x7FE0) in steps of 0.125 (0x0010). 
Note that the measured values in this context are always positive.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LRA_BRD_HS_REG</name>
	<description>LRA Bridge Register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TRIM_GAIN</name>
	<description>Current-sensing amplifier gain settings:
0001: x6
0010: x8
0100: x10
1000: x12</description>
	<bitRange>[14:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HSGND_TRIM</name>
	<description>HS gnd trim, default at 100
000: 2.2V and 111:3.6V with 0.2V per step</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SCP_HS_TRIM</name>
	<description>HS short-circuit protection limit trimming</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SCP_HS_EN</name>
	<description>HS short-circuit protection enable</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ERC_HS_TRIM</name>
	<description>HS edge-rate control trimming. Lowto-High switching slewing:
00: 25 MV/s
01: 50 MV/s
10: 75 MV/s
11: 100 MV/s</description>
	<bitRange>[2:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ERC_HS_EN</name>
	<description>HS edge-rate control enable</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LRA_BRD_LS_REG</name>
	<description>LRA Bridge Register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00004fff</resetMask>
	<fields><field>
	<name>SCP_LS_TRIM_N</name>
	<description>LSN short-circuit protection limit trimming</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SCP_LS_TRIM_P</name>
	<description>LSP short-circuit protection limit trimming</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SCP_LS_EN</name>
	<description>LS short-circuit protection enable</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ERC_LS_TRIM</name>
	<description>LS edge-rate control trimming. High-to-Low switching slewing:
00: 25 MV/s
01: 50 MV/s
10: 75 MV/s
11: 100 MV/s</description>
	<bitRange>[2:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ERC_LS_EN</name>
	<description>LS edge-rate control enable</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LRA_BRD_STAT_REG</name>
	<description>LRA Bridge Staus Register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SCP_HS_OUT</name>
	<description>HS short circuit comparator output</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SCP_LS_COMP_OUT_N</name>
	<description>LSN short circuit comparator output</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SCP_LS_COMP_OUT_P</name>
	<description>LSP short circuit comparator output</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SC_EVENT_LS</name>
	<description>1: LS short-circuit event detected
0: no LS short-circuit event detected</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SC_EVENT_HS</name>
	<description>1: HS short-circuit event detected
0: no HS short-circuit event detected</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LOOP_STAT</name>
	<description>1: Loop saturation detected
0: Loop not saturated</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LSN_ON</name>
	<description>LSN control status</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LSP_ON</name>
	<description>LSP control status</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HSN_ON</name>
	<description>HSN control status</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HSP_ON</name>
	<description>HSP control status</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LSN_STAT</name>
	<description>LSN power FET gate actual status</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LSP_STAT</name>
	<description>LSP power FET gate actual status</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HSN_STAT</name>
	<description>HSN power FET gate actual status</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HSP_STAT</name>
	<description>HSP power FET gate actual status</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>LRA_CTRL1_REG</name>
	<description>General Purpose LRA Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000071c0</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SMP_IDX</name>
	<description>Current bin index (0-15). Check if equal to IRQ_IDX before and/or after updating HALF_PERIOD with ISR.</description>
	<bitRange>[27:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_SCP_EVENT_EN</name>
	<description>0 = interrupt scp event disabled
1 = interupt scp event enabled</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_ADC_EN</name>
	<description>0 = interrupt adc disabled
1 = interupt adc enabled</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_CTRL_EN</name>
	<description>0 = interrupt controller disabled
1 = interupt controller enabled</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_IDX</name>
	<description>At which sample index an IRQ will be generated (0-15). When IRQ_IDX &lt; 8, IRQs are generated at both half cycles (IRQ_IDX and IRQ_IDX+8), otherwise only in the second half cycle.</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_DIV</name>
	<description>Divider value of the interrupt request. Number of LRA/ERM periods, between successive IRQs. 0,1=every (half) cycle, depending on IRQ_IDX; 2=every second cycle, IRQ at the end of first or both half cycles (based on IRQ_IDX), etc.</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SMP_SEL</name>
	<description>Select which samples to store for the resonance control algorithm.
0=Sense voltage after down-sampling
1=Error voltage (after subtraction of VREF and down-sampled sense voltgae input)
2=Duty cycle signal after loop-filter
3=Duty cycle signal after summation with DREF</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PULLDOWN_EN</name>
	<description>LXP and LXN node pull down enbale, when SC_EVENT=0 &amp;&amp; LOOP_EN=0</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LOOP_EN</name>
	<description>0=disable loop
1=enable loop</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_EN</name>
	<description>0=lra ldo disabled
1=lra ldo enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_EN</name>
	<description>0=lra adc disabled
1=lra adc enabled</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HBRIDGE_EN</name>
	<description>0=hbridge disabled
1=hbridge enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LRA_EN</name>
	<description>0=lra controller disabled
1=lra controller enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LRA_CTRL2_REG</name>
	<description>General Purpose LRA Control Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x02710000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>HALF_PERIOD</name>
	<description>Half of the LRA period, in units of 4 ms (= 125 kHz divided by the resonant frequency of the LRA).</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AUTO_MODE</name>
	<description>Automatic frequency control (0=disabled;, 1=enabled, not yet implemented)</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SMP_MODE</name>
	<description>Sampling mode for data aiding automatic resonance control (0=averaging, 1=last sample)</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POLARITY</name>
	<description>Polarity of the square wave (0=normal; 1=inverted); Use for rapid stop.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FLT_IN_SEL</name>
	<description>0 = normal operation
1 = ADC output overruled by register field MAN_FLT_IN</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PWM_MODE</name>
	<description>PWM pulse placement: 0=middle, 1=left, 2=right, 3=alternate</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LRA_CTRL3_REG</name>
	<description>General Purpose LRA Control Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>VREF</name>
	<description>Voltage reference for haptic feedback driver (1 bit sign + 7 bits integer + 8 bits fractional. (range -128 ... +127.99).
The voltage is computed based on the desired reference current (IREF) that flows into the haptic device.
VREF = IREF&#180;TRIM_GAIN&#180;AGC_GAIN&#180;128/2.4,
with IREF in Amperes,
TRIM_GAIN = 6, 8 (default), 10 or 12 as defined in LRA_BRD_HS_REG,
ADC_GAIN is the normalized gain of the ADC (i.e. ADC_GAIN = GP_ADC_VALUE&#180;300 mA/[ILRA&#180;128]).</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DREF</name>
	<description>Duty cycle reference, start value from which the current control loop settles (1 sign bit, 7 integer bits, 8 fractional bits, -128 ... +127.99). Valid settings 5% through 95% (0x0666 - 0x799A).</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>LRA_DFT_REG</name>
	<description>LRA test Register</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>SPARE</name>
	<description>spare registers bits , currently not used</description>
	<bitRange>[31:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SWM_SEL</name>
	<description>0=use SWM from controller
1=use SWM_MAN</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SWM_MAN</name>
	<description>swm manual</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PWM_SEL</name>
	<description>0=use PWM from controller
1=use PWM_MAN</description>
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PWM_MAN</name>
	<description>pwm manual</description>
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER_TRIM</name>
	<description>20ns unit delay cell trimming bits</description>
	<bitRange>[24:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER_SCALE_TRIM</name>
	<description>Selection of delay of MAG and DEMAG signal:
00: 60ns
01: 80ns
10: 100ns
11: 120ns</description>
	<bitRange>[22:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DFT_SEL</name>
	
